# Object Orientented Program

In [1]:
a = 43.4
print(type(a))

<class 'float'>

In [2]:
b = 12.5
print(type(b))

<class 'float'>

In [3]:
c = [12, 13, 14, 15]
print(type(c))

<class 'list'>

In [5]:
d = (1, 2, "Example")
print(type(d))

<class 'tuple'>

In [6]:
g = {"a": 1, "b": 2, "c": 3}
print(type(g))

<class 'dict'>

# Datafram attributes and Functions

In [11]:
e = {
    "emp_id": [101, 102, 103, 104, 105],
    "name": ["Parth", "Aayush", "omkar", "Om", "leo"],
    "Salary": [88000, 50000, 45000, 51000, 100000],
    "dept": ["HR", "B.A", "Marketing", "Finance", "Opration Supply chain"],
}
type(e)

dict

In [12]:
import pandas as pd

df = pd.DataFrame(e)
df

   emp_id    name  Salary                   dept
0     101   Parth   88000                     HR
1     102  Aayush   50000                    B.A
2     103   omkar   45000              Marketing
3     104      Om   51000                Finance
4     105     leo  100000  Opration Supply chain

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
## Class in Objective